Revit 2027 API
ParameterTypeId.ColumnTopAttachmentOffsetParam Property
 "Offset From Attachment At Top"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ColumnTopAttachmentOffsetParam { get; }
Public Shared ReadOnly Property ColumnTopAttachmentOffsetParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ColumnTopAttachmentOffsetParam {
	ForgeTypeId^ get ();
}
static member ColumnTopAttachmentOffsetParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace